{
    "portfolio": "PORTFOLIO",
    "title": "Software engineer, developer, reader and explorer",
    "education": "Education",
    "lisansSchool": "Sakarya University of Applied Sciences",
    "lisansDepartment": "Bachelor's Degree in Mechatronics Engineering",
    "lisansGano": "3.13 / 4.00",
    "lisansYear": "2018 - 2022",
    "yuksekLisansSchool": "Sakarya University of Applied Sciences",
    "yuksekLisansDepartment": "Master's Degree in Computer Engineering",
    "yuksekLisansYear": "2025 - Present",
    "experience": "Experience",
    "karmetalCompany": "Kar Metal",
    "karmetalPosition": "Robotics Software Engineer",
    "karmetalYear": "Feb 2022 - Jun 2025",
    "karmetalDescription": "I worked on image processing and deep learning solutions for AMRs using Robot Operating System (ROS). I developed web applications to control robot fleets.",
    "deneyapCompany": "Deneyap Türkiye",
    "deneyapPosition": "Advanced Robotics Instructor",
    "deneyapYear": "May 2022 - Sep 2022",
    "deneyapDescription": "I conducted coding and robotics sessions as an advanced robotics instructor for high school level students in Deneyap workshops.",
    "publications": "Publications",
    "ShowPublication": "Show Publication",
    "MelanomaTitle": "A System Design for Early Diagnosis of Skin Disorders Using Deep Learning",
    "TDATitle": "A Novel Docking Algorithm for Industrial Autonomous Mobile Robots: TDA",
    "projects": "Projects",
    "servantTTitle": "Deep Learning Based Pallet Pose Estimation System",
    "servantTDescription": "For the pallet pick-up operations of Servant-T, I built a deep learning–based pose estimation system. From the model outputs I extracted point cloud clusters, located the pallet, and applied map transformations.",
    "karmetaldeGerceklestirilmistir":"This study were carried out during the period when I worked in the Karmetal R&D team.",
    "servantWTitle": "Pallet Pose Estimation with Machine Learning Clustering Methods - a RANSAC Method",
    "servantWDescription": "I developed point cloud data processing algorithms to enable the autonomous mobile robot to reliably detect pallets even in low-light conditions. In this process, I used clustering methods such as RANSAC to separate the pallet object from other structures in the field.",
    "qrTitle":"QR Code Detection and Pose Estimation System",
    "qrDescription":"I developed an algorithm that enables the mobile robot to detect QR codes in the field and calculate their 3D positions relative to the camera. Thus, the robot was able not only to read the QR codes but also to calculate their positions in space and use them in navigation processes.",
    "KFMTitle":"KFM - Fleet Management System Web Application",
    "KFMDescription":"I developed a web-based interface to control and monitor robots. I designed and coded the frontend (React) and backend (Node.js, Flask) portions of this application. The application was developed to support integration and communication with ROS. I also handled the database management required by the system. Initially, this web application was configured to run locally.",
    "fersahTitle": "FERSAH - Unmanned Underwater Vehicle",
    "fersahDescription": "As a university team, I developed image-processing-based software to enable the unmanned underwater vehicle (ROV/AUV) we developed to perform autonomous tasks. I particularly focused on gate detection.",
    "teknofestIcinGerceklestirilmistir":"This project was carried out for Teknofest 2020.",
    "omnibotTitle": "OMNIBOT - 3-Wheeled Holonomic Mobile Robot",
    "omnibotDescription": "As part of my undergraduate project, I developed a three-wheeled holonomic mobile robot. This robot is equipped with ROS-based autonomous movement and mapping capabilities.",
    "formore":"see more",
    "contactme":"Contact me",
    "highlights":"Career Highlights",
    "skills":"Skills",
    "daysAtKarmetal":"Days at Karmetal (archive)",
    "kitaplarim":"Wisdom That Guided Me: My Book List",
    "CasemCompany": "Casem ESG",
    "CasemPosition": "Software Engineer",
    "CasemYear": "November 2025 - Present",
    "CasemDescription": "I am working as a software engineer at Casem ESG. I am involved in projects that develop sustainability and environmental, social, governance (ESG) solutions."




}